NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/MGM24/MGM240PB22VNA.svd
        <register>
          <name>FENOTCHFILT9</name>
          <description>No Description</description>
          <addressOffset>0x154</addressOffset>
          <access>read-write</access>
          <resetValue>0x200B200B</resetValue>
          <resetMask>0x3FFF3FFF</resetMask>
          <fields>
            <field>
              <name>FENOTCHATTNSEL19</name>
              <description>FE Notch attn sel code for index 19</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHCAPCRSE19</name>
              <description>FE Notch coarse cap code for index 19</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHCAPFINE19</name>
              <description>FE Notch fine cap code for index 19</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHRATTNEN19</name>
              <description>FE notch rattn enable for index 19</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHEN19</name>
              <description>FE notch enable for index 19</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHATTNSEL20</name>
              <description>FE Notch attn sel code for index 20</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHCAPCRSE20</name>
              <description>FE Notch coarse cap code for index 20</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHCAPFINE20</name>
              <description>FE Notch fine cap code for index 20</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHRATTNEN20</name>
              <description>FE notch rattn enable for index 20</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHEN20</name>
              <description>FE notch enable for index 20</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FENOTCHFILT10</name>
          <description>No Description</description>
          <addressOffset>0x158</addressOffset>
          <access>read-write</access>
          <resetValue>0x200B200B</resetValue>
          <resetMask>0x3FFF3FFF</resetMask>
          <fields>
            <field>
              <name>FENOTCHATTNSEL21</name>
              <description>FE Notch attn sel code for index 21</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHCAPCRSE21</name>
              <description>FE Notch coarse cap code for index 21</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHCAPFINE21</name>
              <description>FE Notch fine cap code for index 21</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHRATTNEN21</name>
              <description>FE notch rattn enable for index 21</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHEN21</name>
              <description>FE notch enable for index 21</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHATTNSEL22</name>
              <description>FE Notch attn sel code for index 22</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHCAPCRSE22</name>
              <description>FE Notch coarse cap code for index 22</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHCAPFINE22</name>
              <description>FE Notch fine cap code for index 22</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHRATTNEN22</name>
              <description>FE notch rattn enable for index 22</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHEN22</name>
              <description>FE notch enable for index 22</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FENOTCHFILT11</name>
          <description>No Description</description>
          <addressOffset>0x15C</addressOffset>
          <access>read-write</access>
          <resetValue>0x200B200B</resetValue>
          <resetMask>0x3FFF3FFF</resetMask>
          <fields>
            <field>
              <name>FENOTCHATTNSEL23</name>
              <description>FE Notch attn sel code for index 23</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHCAPCRSE23</name>
              <description>FE Notch coarse cap code for index 23</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHCAPFINE23</name>
              <description>FE Notch fine cap code for index 23</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHRATTNEN23</name>
              <description>FE notch rattn enable for index 23</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHEN23</name>
              <description>FE notch enable for index 23</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHATTNSEL24</name>
              <description>FE Notch attn sel code for index 24</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHCAPCRSE24</name>
              <description>FE Notch coarse cap code for index 24</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHCAPFINE24</name>
              <description>FE Notch fine cap code for index 24</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHRATTNEN24</name>
              <description>FE notch rattn enable for index 24</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHEN24</name>
              <description>FE notch enable for index 24</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCADEBUG</name>
          <description>No Description</description>
          <addressOffset>0x160</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000003FF</resetMask>
          <fields>
            <field>
              <name>DEBUGCCARSSI</name>
              <description>Mode 1 CCA rssi reading</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DEBUGCCAM1</name>
              <description>Mode 1 Clear Channel Assessment</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DEBUGCCASIGDET</name>
              <description>Signal detector Clear Channel Assessment</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
